app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:title => :asc}, 'hilite'
    when 'director'
      ordering,@director_header = {:director => :asc}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:release_date => :asc}, 'hilite'
    end

    @all_ratings = Movie.all_ratings
    if !session.has_key?(:ratings) #first time app is run, select all movie ratings
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]